s2chhaen/USV/01 Hardware/02 Radar/03 Software/01 source/XC8Application1/ATMegaXX09/USART/USART.c
////////////////////////////////////////////////////////////////////////////////////////////////////
//
// USART.c
//
// Created: 04.09.2020 16:33:50
//  Author: franke
//
//
//		-Implementierung als UART-Treiber
//
//		rev. 0.1
////////////////////////////////////////////////////////////////////////////////////////////////////


#include "USART.h"
#include "USART_config.h"
#include "../../Math/MinMax.h"
#include "../ATMegaXX09Clock.h"
#include "../Port/Port.h"
#include "../EEPROM/EEPROM.h"
#include "../FIFO/FIFO.h"

#if USART_USE_EVENTSYSTEM==1
#include USART_EVENTSYSTEM_HEADER
#endif

#include <stddef.h>
#include <stdlib.h>
#include <avr/interrupt.h>


////////////////////////////////////////////////////////////////////////////////////////////////////
//
// USART lokale Definitionen
//
////////////////////////////////////////////////////////////////////////////////////////////////////
#if defined USART3
	#define COUNT_USART 4
#elif defined USART2
	#define COUNT_USART 3
#elif defined USART1
	#define COUNT_USART 2
#elif defined USART0
	#define COUNT_USART 1
#else
	#define COUNT_USART 0
#endif

////////////////////////////////////////////////////////////////////////////////////////////////////
//
// lokale Makros
//
////////////////////////////////////////////////////////////////////////////////////////////////////
#define PASTE2( a, b) a##b
#define PASTE3( a, b ,c) a##b##c
#define ISR_vect( obj, num , typ) obj##num##_##typ##_vect
#define ISR_vect_num( obj, num , typ) obj##num##_##typ##_vect_num
#define MACRO_DDR( port) PASTE2( DDR, port)
#define MACRO_DDR_BIT( port, bit) PASTE3( DD, port ,bit)
#define SETBIT(port,bit) ((port)|=1L<<(bit))
#define CLEARBIT(port,bit) ((port)&=~(1L<<(bit)))

////////////////////////////////////////////////////////////////////////////////////////////////////
//
// lokale Typendefinition
//
////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////
//
// USART Types
//
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint16_t Word;
	uint8_t ByteArr[2];
	struct
	{
		uint8_t Low;
		uint8_t High;
	}Byte;
}unuint16_t;

/////////////////////////////////////////////////////////////////////////////////////////
//
// USART Register Types
//
/////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////
// USART Receiver Data Register
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint16_t Word[1];
	uint8_t ByteArr[2];
	struct 
	{
		uint16_t DATA:9;
		uint8_t PERR:1;
		uint8_t FERR:1;
		uint8_t reserved:3;
		uint8_t BUFOVF:1;
		uint8_t RXCIF:1;
	}Register;
}RXDATA_t;

/////////////////////////////////////////////////////////////////////////////////////////
// USART Control and Status Register A
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint8_t this;
	uint8_t Byte;
	struct
	{	// Low Bit
		uint8_t RS485:2;
		uint8_t ABEIE:1;
		uint8_t LBME:1;
		uint8_t RXSIE:1;
		uint8_t DREIE:1;
		uint8_t TXCIE:1;
		uint8_t RXCIE:1;
	}Register;
}CTRLA_t;

/////////////////////////////////////////////////////////////////////////////////////////
//USART Control and Status Register B
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint8_t Byte;
	struct
	{	// Low Bit
		uint8_t MPCM:1;
		uint8_t RXMODE:2;
		uint8_t ODME:1;
		uint8_t SFDEN:1;
		uint8_t reserved:1;
		uint8_t TXEN:1;
		uint8_t RXEN:1;
	}Register;
}CTRLB_t;

/////////////////////////////////////////////////////////////////////////////////////////
// USART Control and Status Register C
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint8_t Byte;
	struct
	{	// Low Bit
		uint8_t CHSIZE:3;
		uint8_t SBMODE:1;
		uint8_t PMODE:2;
		uint8_t CMODE:2;
	}Reg_AsyncMode;
	struct
	{	// Low Bit
		uint8_t reserved0:1;
		uint8_t UCPHA:1;
		uint8_t UDORD:1;
		uint8_t reserved1:3;
		uint8_t CMODE:2;
	}Reg_MasterSPI;
}CTRLC_t;

/////////////////////////////////////////////////////////////////////////////////////////
// USART Control and Status Register D
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint8_t Byte;
	struct
	{	// Low Bit
		uint8_t reserve:6;
		uint8_t ABW:2;
	}Register;
}CTRLD_t;

/////////////////////////////////////////////////////////////////////////////////////////
// USART Status Register
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	register8_t Byte;
	struct
	{	// Low Bit
		uint8_t WFB:1;
		uint8_t BDF:1;
		uint8_t reserve:1;
		uint8_t ISFIF:1;
		uint8_t RXSIF:1;
		uint8_t DREIF:1;
		uint8_t TXCIF:1;
		uint8_t RXCIF:1;
	}Register;
}STATUS_t;
#define fastSTATUS(handle) ((STATUS_t)handle->STATUS)

/////////////////////////////////////////////////////////////////////////////////////////
// PORTMUX Control register for USART
/////////////////////////////////////////////////////////////////////////////////////////
typedef union
{
	uint8_t Byte;
	struct
	{
		PORTMUX_USARTx_t USART3_2:2;
		PORTMUX_USARTx_t USART2_2:2;
		PORTMUX_USARTx_t USART1_2:2;
		PORTMUX_USARTx_t USART0_2:2;
	}Register;
}USARTROUTEA_t;

////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	USART Port Tables Defines
//
////////////////////////////////////////////////////////////////////////////////////////////////////
EEMEM const uint8_t USARTPort[4] = {0, 2, 5, 1};

EEMEM const uint8_t USARTPortTX_Set[4] = {0x11,0x11,0x11,0x11};
EEMEM const uint8_t USARTPortRX_Clear[4] = {0x22,0x22,0x22,0x22};
EEMEM const uint8_t USARTPortXCK_Set[4] = {0x44,0x44,0x44,0x04};
EEMEM const uint8_t USARTPortXDIR_Set[4] = {0x88,0x88,0x08,0x08};
EEMEM const uint8_t USARTPortDirMask[4] = {0x0F, 0xF0, 0x00, 0x00};


EEMEM const uint8_t USARTRXEventID[4] = {USART0_RXC_vect_num, USART1_RXC_vect_num, \
	USART2_RXC_vect_num, (int16_t)NULL};
EEMEM const uint8_t USARTTXEventID[4] = {USART0_TXC_vect_num, USART1_TXC_vect_num, \
	USART2_TXC_vect_num, (int16_t)NULL};

////////////////////////////////////////////////////////////////////////////////////////////////////
//
//	USART lokale Variablen
//
////////////////////////////////////////////////////////////////////////////////////////////////////
USART_receive_Array_callback_fnc_t USART_receive_Array_callback[4] = {NULL};								// 8 Bytes
USART_send_Array_callback_fnc_t USART_send_Array_callback[4] = {NULL};										// 8 Bytes

