s2chhaen/USV/01 Hardware/02 Radar/03 Software/01 source/XC8Application1/ATMegaXX09/USART/USART.c
USART_t* const USART_handle[4] =
{
	#ifdef USART0
	&USART0,
	#else
	NULL,
	#endif

	#ifdef USART1
	&USART1,
	#else
	NULL,
	#endif
	
	#ifdef USART2
	&USART2,
	#else
	NULL,
	#endif
	
	#ifdef USART3
	&USART3
	#else
	NULL
	#endif
};																											// 4 Bytes

uint8_t USART_adresse[4] = {0};																				// 4 Bytes
uint8_t USART_bytes_to_receive[4] = {0};																	// 4 Bytes
uint8_t USART_bytes_received[4] = {0};																		// 4 Bytes
uint8_t USART_end_of_string[4] = {0};																		// 4 Bytes		//im Vgl. zu Bib-Datei hinzugefuegt von Haendel, 13.03.2023 

////////////////////////////////////////////////////////////////////////////////////////////////////
// USART FIFOs
////////////////////////////////////////////////////////////////////////////////////////////////////
sFIFO_t USART_RX_FIFO[COUNT_USART] = preinit_FIFO_arr(COUNT_USART);											// max. 4x35 Bytes
sFIFO_t USART_TX_FIFO[COUNT_USART] = preinit_FIFO_arr(COUNT_USART);											// max. 4x35 Bytes

////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Definition lokaler Funktionen
//
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_RXC_Byte(USART_t* const handle, uint8_t USARTnumber, uint8_t event_id);
void USART_TXC_Byte(USART_t* const handle, uint8_t USARTnumber, uint8_t event_id);

////////////////////////////////////////////////////////////////////////////////////////////////////
// Interrupt Service Routinen defines
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// Makro für USART-ISR abhängig von der USART-Nummer und Typ
////////////////////////////////////////////////////////////////////////////////////////////////////
//*//
#define ISR_USARTx_INT(USARTnumber, typ) \
ISR(ISR_vect(USART,USARTnumber,typ))\
{\
		PASTE3(USART_,typ,_Byte)(USART_handle[USARTnumber],USARTnumber, ISR_vect_num(USART,USARTnumber,typ));\
		USART_handle[USARTnumber]->STATUS &=  PASTE3(USART_,typ,IF_bm);\
}\
//*/

/*//
ISR(USART0_RXC_vect)
{
	PASTE3(USART_,RXC,_Byte)(USART_handle[0],0,ISR_vect_num(USART,0,RXC));
	//USART_RXC_Byte(USART_handle[0],0,0);
	USART_handle[0]->STATUS &=  PASTE3(USART_,RXC,IF_bm);
}
//*/

////////////////////////////////////////////////////////////////////////////////////////////////////
// Interrupt Service Routinen
////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma GCC push_options
#pragma GCC optimize("O3")
#ifdef USART0
ISR_USARTx_INT(0,RXC)
ISR_USARTx_INT(0,TXC)
//ISR_USARTx_INT(0,DRE)
#endif
#ifdef USART1
ISR_USARTx_INT(1,RXC)
ISR_USARTx_INT(1,TXC)
//ISR_USARTx_INT(1,DRE)
#endif
#ifdef USART2
ISR_USARTx_INT(2,RXC)
ISR_USARTx_INT(2,TXC)
//ISR_USARTx_INT(2,DRE)
#endif
#ifdef USART3
ISR_USARTx_INT(3,RXC)
ISR_USARTx_INT(3,TXC)
//ISR_USARTx_INT(3,DRE)
#endif
#pragma GCC pop_options

////////////////////////////////////////////////////////////////////////////////////////////////////
//
// Funktionendeklaration
//
////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////
// bool USART_init(uint8_t USARTnumber, uint32_t baudrate, USART_CHSIZE_t bits, USART_PMODE_t parity, 
//	USART_SBMODE_t stopbit, bool sync, bool addressmode, uint8_t address)
//
// Initialisiert die USART Schnittstelle
////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma GCC push_options
#pragma GCC optimize("O0")
bool USART_init(uint8_t USARTnumber, uint32_t baudrate, USART_CHSIZE_t bits, USART_PMODE_t parity, \
	USART_SBMODE_t stopbit, bool sync, bool MPCM, uint8_t address, PORTMUX_USARTx_t PortMux)
{
	USART_t* const handle = USART_handle[USARTnumber];
	unuint16_t u16_baudteiler = {0};
	
	// Registerinhalte laden
	CTRLA_t UCSRA = {.Byte = 0x00};
	CTRLB_t UCSRB = {.Byte = 0x00};
	CTRLC_t UCSRC = {.Byte = USART_CHSIZE_8BIT_gc};
	CTRLD_t UCSRD = {.Byte = 0x00};
	
	// Lade das Port-Mux-Register von der USART-Schnittstellen
	USARTROUTEA_t USARTROUTEA = {.Byte = PORTMUX.USARTROUTEA};
	
	bool returnval = true;
	
	// Prüfe auf die Konsistenz der Eingangsvariablen
	if((bits > USART_CHSIZE_9BITH_gc)||((bits > USART_CHSIZE_8BIT_gc)&&(bits < USART_CHSIZE_9BITL_gc))\
		||(parity > USART_PMODE_ODD_gc)||\
		((stopbit < USART_SBMODE_1BIT_gc)&&(stopbit > USART_SBMODE_2BIT_gc)))
	{
		returnval = true;
	}
	else if(handle != NULL)
	{
		// Berechnen des Bautratenregister für synchrone oder
		if(sync)
		{
			u16_baudteiler.Word = (uint16_t)MIN((((CLK_CPU/baudrate/2))<<6), UINT16_MAX);
		}
		else // für asynchrone Übertragungen
		{
			u16_baudteiler.Word = (uint16_t)MIN(((CLK_CPU*8)/baudrate),UINT16_MAX);
			if(u16_baudteiler.Word < 64)
			{
				u16_baudteiler.Word = 64;
			}
		}
		
		// Anzahl der Bits einstellen
		UCSRC.Reg_AsyncMode.CHSIZE = bits;
		
		// Parität einstellen
		UCSRC.Reg_AsyncMode.PMODE = ((uint8_t)parity>>4);
		
		// synchrone Übertragung einstellen
		if(sync)
		{
			UCSRC.Reg_AsyncMode.CMODE = ((uint8_t)USART_CMODE_SYNCHRONOUS_gc>>6);
		}
		else
		{
			UCSRC.Reg_AsyncMode.CMODE = ((uint8_t)USART_CMODE_ASYNCHRONOUS_gc>>6);
		}
		
		// USART Multiprozessor Kommunikation einstellen für RS485
		if(MPCM)
		{
			UCSRA.Register.RS485 = USART_RS485_EXT_gc;
			UCSRB.Register.MPCM = true;
			USART_adresse[USARTnumber] = address;
			
			// Zwei Stop-Bits einstellen, zwingend notwendig für den MPCM
			UCSRC.Reg_AsyncMode.SBMODE  = (uint8_t)USART_SBMODE_2BIT_gc>>3;
		} 
		else
		{
			UCSRA.Register.RS485 = USART_RS485_OFF_gc;
			UCSRB.Register.MPCM = false;
			USART_adresse[USARTnumber] = 0x00;
			
			// Stop-Bit einstellen
			UCSRC.Reg_AsyncMode.SBMODE = ((uint8_t)stopbit>>3);
		}
		
		// schalte doppelte Geschwindigkeit an (nur asynchrone Übertragungen)
		if(!sync)
			UCSRB.Register.RXMODE = (uint8_t)USART_RXMODE_CLK2X_gc>>1;
		
		// Konfiguriere I/O-Pins und den Portmultiplexer
		USARTROUTEA.Byte = PORTMUX.USARTROUTEA;
		switch(USARTnumber)
		{
		case 0:
			USARTROUTEA.Register.USART0_2 = PortMux;
			break;
		case 1:
			USARTROUTEA.Register.USART1_2 = PortMux;
			break;
		case 2:
			USARTROUTEA.Register.USART2_2 = PortMux;
			break;
		case 3:
			USARTROUTEA.Register.USART3_2 = PortMux;
			break;
		}
		
		// Schalte RX und TX an
		UCSRB.Register.RXEN = true;
		UCSRB.Register.TXEN = true;
		
		// Schalte RX und TX Interrupte an
		UCSRA.Register.RXCIE = true;
		UCSRA.Register.TXCIE = true;
		
		// Schreibe das Port-Mux-Register für die UART-Schnittstelle
		PORTMUX.USARTROUTEA = USARTROUTEA.Byte;
		
		// Schreibe die UART-Register
		handle->CTRLA = UCSRA.Byte;
		handle->CTRLB = UCSRB.Byte;
		handle->CTRLC = UCSRC.Byte;
		handle->CTRLD = UCSRD.Byte;
		
