s2chhaen/USV/01 Hardware/02 Radar/03 Software/01 source/XC8Application1/ATMegaXX09/USART/USART.c
		handle->BAUD = u16_baudteiler.Word;
		
		handle->DBGCTRL  = 0x00;
		handle->EVCTRL   = 0x00;
		handle->TXPLCTRL = 0x00;
		handle->RXPLCTRL = 0x00;
		
		// Konfiguriere die Portregister
		{
			
			uint8_t USARTPort_loc;
			uint8_t USARTPort_Mask_loc;
			uint8_t USARTPortTX_Set_loc;
			uint8_t USARTPortRX_Clear_loc;
			uint8_t USARTPortXCK_SET_loc = 0x00;
			uint8_t USARTPortXDIR_SET_loc = 0x00;
			
			while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
			USARTPort_loc = MAP_EEPROM(USARTPort[USARTnumber]);
			
			while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
			USARTPort_Mask_loc = MAP_EEPROM(USARTPortDirMask[PortMux]);
			
			while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
			USARTPortTX_Set_loc = MAP_EEPROM(USARTPortTX_Set[USARTnumber]);
			
			while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
			USARTPortRX_Clear_loc = MAP_EEPROM(USARTPortRX_Clear[USARTnumber]);
			
			
			if(sync)
			{
				while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
				USARTPortXCK_SET_loc = MAP_EEPROM(USARTPortXCK_Set[USARTnumber]);
			}
			if(MPCM)
			{
				while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
				USARTPortXDIR_SET_loc = MAP_EEPROM(USARTPortXDIR_Set[USARTnumber]);
			}
			
			if((USARTPort_Mask_loc != 0xFF)&&(USARTPort_loc != 0xFF))
			{
				PORTs.INDEX[USARTPort_loc].DIRSET = \
				(USARTPortTX_Set_loc|USARTPortXCK_SET_loc|USARTPortXDIR_SET_loc) & USARTPort_Mask_loc;
				PORTs.INDEX[USARTPort_loc].DIRCLR = USARTPortRX_Clear_loc & USARTPort_Mask_loc;
				returnval = false;
			}
			else
			{
				returnval = true;
			}
		}
	}
	
	return returnval;
}
#pragma GCC pop_options

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_DeInit(uint8_t USARTnumber)
//
// Deinitialisiert die USART Schnittstelle
//  alle Register werden zurückgesetzt
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_DeInit(uint8_t USARTnumber)
{
	USART_t* handle = USART_handle[USARTnumber];
	
	// Registerinhalte laden
	CTRLA_t UCSRA = {.Byte = 0x00};
	CTRLB_t UCSRB = {.Byte = 0x00};
	CTRLC_t UCSRC = {.Byte = USART_CHSIZE_8BIT_gc};
	CTRLD_t UCSRD = {.Byte = 0x00};
		
	// Schreibe die UART-Register
	handle->CTRLA = UCSRA.Byte;
	handle->CTRLB = UCSRB.Byte;
	handle->CTRLC = UCSRC.Byte;
	handle->CTRLD = UCSRD.Byte;
		
	handle->BAUD = 0x0000;
		
	handle->DBGCTRL  = 0x00;
	handle->EVCTRL   = 0x00;
	handle->TXPLCTRL = 0x00;
	handle->RXPLCTRL = 0x00;
	
	USART_receive_Array_callback[USARTnumber] = NULL;
	USART_adresse[USARTnumber] = 0;
	USART_adresse[USARTnumber] = 0;
	USART_bytes_received[USARTnumber] = 0;
	
	FIFO_flush(&USART_RX_FIFO[USARTnumber]);
	FIFO_flush(&USART_TX_FIFO[USARTnumber]);
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_get_RX_Byte(uint8_t event_id, uint8_t eventdata)
//	Interne Funktion, der Aufruf erfolgt nur über die ISR()
//		
//		const USART_t* handle -> Zeiger auf die USART-Register
//		uint8_t USARTnumber -> Nummer des USART-Ports.
//		uint8_t event_id -> Event-ID-Nummer
////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma GCC push_options
#pragma GCC optimize("O3")
void USART_RXC_Byte(USART_t* const handle, uint8_t number, uint8_t event_id)
{
	uint8_t Buffer = 0;
	
	CTRLB_t UCSRB;
	
	UCSRB.Byte = handle->CTRLB;
	// USART Multiprozessor-Kommunikation
	if(UCSRB.Register.MPCM == true)
	{
		
	}
	else // normale USART Operation
	{
		// prüfe ob Daten vorhanden sind
		if( fastSTATUS(handle).Register.RXCIF == true )
		{
			// prüfe ob Daten in den FIFO geschrieben werden können
			if(FIFO_chk_for_writedata(&USART_RX_FIFO[number]))
			{
				// lese Byte aus dem Buffer
				Buffer = handle->RXDATAL;
				
				// schreibe Byte in den FIFO
				FIFO_writebyte(&USART_RX_FIFO[number], Buffer);
				
				// Bytezähler vergrößern
				USART_bytes_received[number]++;
				
				/*		Hier erfolgt eine Anpassung der UART-Uebertragung aus der Bibliothek, da nicht immer eine vordefinierte Bytezahl uebertragen werden soll, sondern bis zum Zeichenkettenende */
				// Pruefe ob die vorgegebene Anzahl an Bytes gelesen worden sind, wenn die Anzahl definiert wurde oder ob Zeichenketten-Ende erreicht ist. Meist Linefeed 0x0A	
				if(((USART_bytes_to_receive[number]!=0) && (USART_bytes_to_receive[number] == USART_bytes_received[number])) || (Buffer==USART_end_of_string[number]))	//geaendert im Vgl. zu Bib-Datei; Haendel, 13.03.2023
				{
					#if USART_USE_EVENTSYSTEM==1
					
					ISR_C_func(event_id);
					USART_bytes_received[number] = 0;
					
					#elif USART_USE_EVENTSYSTEM==0
					// Prüfen ob eine Callbackfunktion hinterlegt ist
					if(USART_receive_Array_callback[number] != NULL)
					{
						uint8_t Adress = 0;
						uint8_t* Data = NULL;
						uint8_t length = USART_bytes_received[number];
						
						// Länge des Arrays bestimmen (vollständige Datenanzahl im FIFO)
						length = FIFO_diff_readdata(&USART_RX_FIFO[number]);
						
						// Datenarray für die Funktionsübergabe anlegen
						Data = (uint8_t*)malloc(length*sizeof(uint8_t));
						
						// Kopiere Daten in den FIFO
						FIFO_copy_to_lin(Data, &USART_RX_FIFO[number], length);
						
						// Rufe Callbackfunktion auf
						USART_receive_Array_callback[number](Adress, Data, length);
						
						// lösche Datenarray
						free(Data);
						
						USART_bytes_received[number] = 0;
					}
					#endif //USART_USE_EVENTSYSTEM==0		
				}
			}
		}
	}
}
#pragma GCC pop_options

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_set_TX_Byte(uint8_t USARTnumber)
//	Interne Funktion, der Aufruf erfolgt nur über die ISR()
//
//		const USART_t* handle -> Zeiger auf die USART-Register
//		uint8_t USARTnumber -> Nummer des USART-Ports.
//		uint8_t event_id -> Event-ID-Nummer
////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma GCC push_options
#pragma GCC optimize("O3")
void USART_TXC_Byte(USART_t* const handle, uint8_t USARTnumber, uint8_t event_id)
{
	//uint8_t Adress_Flag  = 0;
	uint8_t Buffer = 0;
	CTRLB_t UCSRB;
	
	UCSRB.Byte = handle->CTRLB;
	// USART Multiprozessor-Kommunikation
	if(UCSRB.Register.MPCM == true)
	{
		
