s2chhaen/USV/01 Hardware/02 Radar/03 Software/01 source/XC8Application1/ATMegaXX09/USART/USART.c
	}
	else // normale USART Operation
	{
		if(FIFO_readbyte(&USART_TX_FIFO[USARTnumber], &Buffer))
		{
			// Abfragen ob USART frei ist
			if(fastSTATUS(handle).Register.DREIF == true)
				handle->TXDATAL = Buffer;
		}
		else // Wenn keine Daten im FIFO mehr vorhanden sind, Aufruf von der Callback-TX-Funktion
		{
			#if USART_USE_EVENTSYSTEM==1
			ISR_C_func(event_id);
			#elif USART_USE_EVENTSYSTEM==0
			uint8_t Adress = 0;
			uint8_t* Data = NULL;
			uint8_t length = 0;
			// Prüfen ob eine Callbackfunktion hinterlegt ist
			if(USART_send_Array_callback[USARTnumber] != NULL)
			{
				// Aufrufen der Callback-Funktion
				USART_send_Array_callback[USARTnumber](&Adress, &Data, &length, FIFO_diff_writedata(&USART_TX_FIFO[USARTnumber]));
				// Prüfen ob Daten kopiert worden sind
				if((Data != NULL) && (length != 0))
				{
					// Kopiere Daten in den FIFO
					FIFO_copy_from_lin(&USART_TX_FIFO[USARTnumber], Data, length);
					// Prüfe ob der übergebene Zeiger im Heap liegt
					if(((void*)__malloc_heap_start < (void*)Data) && ((void*)__malloc_heap_end >= (void*)Data))
					{
						//Wenn ja, dann löschen des Heapspeichers
						free(Data);
					}
					
					// Schreiben des ersten Bytes in das USART_UDR Register
					if(FIFO_readbyte(&USART_TX_FIFO[USARTnumber], &Buffer))
					{
						// Abwarten bis USART frei ist
						while ( !fastSTATUS(handle).Register.DREIF );
						// Kopiere Byte
						handle->TXDATAL = Buffer;
					}
				}
			}
			#endif //USART_USE_EVENTSYSTEM==0
		}
	}
}
#pragma GCC pop_options

////////////////////////////////////////////////////////////////////////////////////////////////////
// bool USART_send_Array(uint8_t USARTnumber, uint8_t adress, uint8_t data[], uint8_t length)
//
// Funktion zum Senden eines Frames über die USART Schnittstelle. Daten werden vorher im FIFO
// abgelegt und nacheinander gesendet.
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports.
//		uint8_t adress		-> Adresse für den Empfänger für die Multiprozessor-Kommunikation.
//		uint8_t data[]		-> Daten-Array, welche übertragen weden sollen.
//		uint8_t length		-> Länge des Daten-Arrays.
//	
//	Übergabeparameter:
//		return bool			-> 	Daten wurden erfolgreich in den FIFO übertragen und die Übertragung
//								wurde gestartet.
////////////////////////////////////////////////////////////////////////////////////////////////////
bool USART_send_Array(uint8_t USARTnumber, uint8_t adress, uint8_t data[], uint8_t length)
{
	USART_t* handle = USART_handle[USARTnumber];
	bool returnval = false;
	// Prüfen ob Daten kopiert worden sind
	if((data != NULL) && (length != 0))
	{
		// Schreiben des ersten Bytes in das USART_UDR Register
		// Abfragen ob USART frei ist
		//if(fastSTATUS(handle).Register.DREIF) <- geht beim ATMEGA4809 durch den TX buffer nicht mehr
		// in dem Zusammenhang
		// Jetzt abfragen ob der FIFO leer ist
		if(!FIFO_chk_for_readdata(&USART_TX_FIFO[USARTnumber]))
		{
			// Kopiere erstes Byte
			handle->TXDATAL = data[0];
			
			// Kopiere die Restlichen Daten in den FIFO
			FIFO_copy_from_lin(&USART_TX_FIFO[USARTnumber], data+1, length-1);
			returnval = true;
		}
		else
		{
			// Kopiere die Restlichen Daten in den FIFO
			FIFO_copy_from_lin(&USART_TX_FIFO[USARTnumber], data, length);
			returnval = true;
		}
	}
	return returnval;
}


////////////////////////////////////////////////////////////////////////////////////////////////////
// bool USART_receive_Array(uint8_t USARTnumber, uint8_t* adress, uint8_t* data[], 
// uint8_t max_length, uint8_t* length)
//
// Liest die zuvor emfpangenen Bytes aus dem FIFO aus und speichert diese in ein Array.
// Das Array muss vorher angelegt und als Zeiger übergeben werden.
// 
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//		uint8_t* adress		-> Zeiger auf einen externen Speicherbereich für die empfangene Adresse.
//		uint8_t* data[]		-> Zeiger auf einen externes Datenarray.
//		uint8_t max_length	-> Maximale Länge des Datenarrays.
//		uint8_t* length		-> Zeiger auf einen externen Speicherbereich für die gespeicherte Länge.
//	Übergabeparameter:
//		return bool			-> true keine weiteren Daten im FIFO
//		adress				-> Empfänger-Adresse für die Multiprozessor-Kommunikation. 
//		data[]				-> Empfangsdaten der USART.
//		length				-> Länge der gespeicherten Daten.
////////////////////////////////////////////////////////////////////////////////////////////////////
#pragma GCC push_options
#pragma GCC optimize("O3")
bool USART_receive_Array(uint8_t USARTnumber, uint8_t* adress, uint8_t* data[], uint8_t max_length,\
	uint8_t* length)
{
	*length = 0;
	if(adress!=NULL)
		*adress = 0;
	// Prüfen ob Daten kopiert werden können
	if(data != NULL)
	{
		// lese die maximale Anzahl der Bytes im FIFO
		*length = MIN(max_length, FIFO_diff_readdata(&USART_RX_FIFO[USARTnumber]));
		if(*length != 0)
		{
			// Kopiere Daten vom FIFO in das Array
			FIFO_copy_to_lin(*data, &USART_RX_FIFO[USARTnumber], *length);
		}
	}
	
	return (FIFO_diff_readdata(&USART_RX_FIFO[USARTnumber]) == 0);
}
#pragma GCC pop_options

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_set_receive_Array_callback_fnc(uint8_t USARTnumber, 
//	USART_receive_Array_callback_fnc_t USART_receive_Array_callback_in)
//
// Speichert die Empfangs-Callback-Funktion.
// Diese wird nach einem vollständigen empfangenen Frame aufgerufen.
// Die Framelänge wird mit der Funktion "USART_set_Bytes_to_receive" eingestellt.
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//		USART_receive_Array_callback_fnc_t USART_receive_Array_callback_in -> Funktionszeiger für 
//																			  die Callbackfunktion 
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_set_receive_Array_callback_fnc(uint8_t USARTnumber, \
	USART_receive_Array_callback_fnc_t USART_receive_Array_callback_in)
{
	if(USART_receive_Array_callback_in != NULL)
	{
		USART_receive_Array_callback[USARTnumber] = USART_receive_Array_callback_in;
	}
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_set_send_Array_callback_fnc(uint8_t USARTnumber, 
//	USART_send_Array_callback_fnc_t USART_send_Array_callback_in)
//
// Speichert den Zeiger der Sende-Callback-Funktion.
// Diese wird nach einem vollständigen gesendeten Frame aufgerufen.
// Die Framlänge wird mit der Funktion "USART_send_Array" übergeben.
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//		USART_send_Array_callback_fnc_t USART_send_Array_callback_in -> Funktionszeiger für
//																		die Callbackfunktion 
//
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_set_send_Array_callback_fnc(uint8_t USARTnumber, \
	USART_send_Array_callback_fnc_t USART_send_Array_callback_in)
{
	if(USART_send_Array_callback_in != NULL)
	{
		USART_send_Array_callback[USARTnumber] = USART_send_Array_callback_in;
	}
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_set_Bytes_to_receive(uint8_t USARTnumber, uint8_t Bytes_to_receive)
//	
// Speichert die Framelänge die empfangen werden soll, eh ein Callback oder ein Event aufgerufen 
// wird.
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//		uint8_t Bytes_to_receive -> Bytes die empfangen werden sollen. 
//									Maximale Anzahl wird duch den FIFO bestimmt.
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_set_Bytes_to_receive(uint8_t USARTnumber, uint8_t Bytes_to_receive)
{
	USART_bytes_to_receive[USARTnumber] = Bytes_to_receive;
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// void USART_set_end_of_string(uint8_t USARTnumber, uint8_t end_of_string)			//im Vgl. zu Bib-Datei hinzugefuegt von Haendel, 13.03.2023 
//
// Legt das Zeichenkettenende der Uebertragung fest
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//		uint8_t end_of_string -> Zeichenkettenende bis zu welchem die Bytes empfangen werden sollen.
//									Maximale Anzahl wird duch den FIFO bestimmt.
////////////////////////////////////////////////////////////////////////////////////////////////////
void USART_set_end_of_string(uint8_t USARTnumber, uint8_t end_of_string)
{
	USART_end_of_string[USARTnumber] = end_of_string;
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// uint8_t USART_get_RXeventID(uint8_t USARTnumber)
//
//	Gibt dynamisch die RX-Event-ID zur USART Nummer zurück 
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//
////////////////////////////////////////////////////////////////////////////////////////////////////
uint8_t USART_get_RXeventID(uint8_t USARTnumber)
{
	while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
	return MAP_EEPROM(USARTRXEventID[USARTnumber]);
}

////////////////////////////////////////////////////////////////////////////////////////////////////
// uint8_t USART_get_TXeventID(uint8_t USARTnumber)
//
//	Gibt dynamisch die RX-Event-ID zur USART Nummer zurück 
//
//	Übernahmeparameter:
//		uint8_t USARTnumber -> Nummer des USART-Ports
//
////////////////////////////////////////////////////////////////////////////////////////////////////
uint8_t USART_get_TXeventID(uint8_t USARTnumber)
{
	while((NVMCTRL.STATUS&NVMCTRL_EEBUSY_bm) == NVMCTRL_EEBUSY_bm);
	return MAP_EEPROM(USARTTXEventID[USARTnumber]);
}

// EOF //
